---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LayerElemTopConstraint
source: html/9f3ceb8e-3d89-4d0f-a71a-f1cb729ae1e1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LayerElemTopConstraint Property

"Top Constraint"

## Syntax (C#)
```csharp
public static ForgeTypeId LayerElemTopConstraint { get; }
```